# Початковий текст
text = (
    "Python - об'єктно-орієнтована мова програмування високого рівня із суворою "
    "динамічною типізацією. Розроблена на початку 1990-х років Гвідо ван Россумом. Структури даних "
    "високого рівня разом із динамічною семантикою та динамічним зв'язуванням роблять її привабливою "
    "для швидкої розробки програм, а також як засіб поєднування наявних компонентів. Python підтримує "
    "модулі та пакети модулів, що сприяє модульності та повторному використанню коду. Інтерпретатор "
    "Python та стандартні бібліотеки доступні як у скомпільованій, так і у вихідній формі на всіх основних "
    "платформах. В мові програмування Python підтримується кілька парадигм програмування, зокрема: "
    "об'єктно-орієнтована, процедурна, аспектно-орієнтована та функціональна. Python має ефективні "
    "структури даних високого рівня та простий підхід."
)

# Функції

# Функція для підрахунку кількісті слів у тексті
def count_words(text):
    a = text.split()
    print("Загальна кількість слів у тексті:", len(a))
    return text

# Функція для підрахунку кількісті використань слова у тексті
def count(text):
    word = input("Введіть слово для підрахунку кількості використань у тексті: ")
    a = text.lower().count(word.lower())
    print(f"Кількість використань слова '{word}':", a)
    return text

# Функція для заміни слів
def replace(text):
    word1 = input("Введіть слово яке бажаєте змінити: ")
    word2 = input("Введіть слово на яке бажаєте змінити: ")
    new_text = text.replace(word1, word2)
    print(f"\nТекст із заміною слова '{word1}' на '{word2}':\n", new_text)
    return new_text

# Функція для зміни регістру
def register(text):
    choice = input("Введіть 1 для нижнього регістру або 2 для верхнього регістру: ")
    if choice == "1":
        new_text = text.lower()
        print("\nТекст з малими літерами:\n", new_text)
        return new_text
    elif choice == "2":
        new_text = text.upper()
        print("\nТекст з великими літерами:\n", new_text)
        return new_text
    else:
        print("Помилка: некоректне значення.")
        return text

# Функція для пошуку слова у тексті
def find(text):
    word = input("Введіть слово яке бажаєте знайти: ")
    a = text.find(word)
    if a != -1:
        print(f"Перше входження слова '{word}' починається з символа:", a)
    else:
        print(f"Слово '{word}' не знайдено.")
    return text

# Функція для перевірки початку тексту 
def check(text):
    word = input("Введіть слово для перевірки початку тексту: ")
    if text.startswith(word):
        print("Текст починається з цього слова.")
    else:
        print("Текст не починається з цього слова.")
    return text

# Головне меню

while True:
    print("=== МЕНЮ ===") 
    print("1. Підрахувати кількість слів у тексті") # Виконав Матросов
    print("2. Підрахувати кількість використань слова") # Виконав Матросов
    print("3. Замінити слово") # Виконав Матросов
    print("4. Змінити регістр тексту") # Виконав Матросов
    print("5. Знайти слово в тексті") # Виконав Матросов
    print("6. Перевірити початок тексту") # Виконав Матросов
    print("7. Вивести поточний текст") #  Виконав Матросов
    print("0. Вийти") # Виконав Матросов

    choice = input("Оберіть дію: ")

    if choice == "1":
        text = count_words(text)
    elif choice == "2":
        text = count(text)
    elif choice == "3":
        text = replace(text)
    elif choice == "4":
        text = register(text)
    elif choice == "5":
        text = find(text)
    elif choice == "6":
        text = check(text)
    elif choice == "7":
        print("\nПОТОЧНИЙ ТЕКСТ:\n", text)
    elif choice == "0":
        print("Завершення програми.")
        break
    else:
        print("Некоректний вибір. Спробуйте ще раз.")

    # Нступний студент може виконати такі функції:
    #1 Видалити слово в тексті 
    #2 Додати речення в кінець тексту 
    #3 Знайти найдовше слово в тексті